### Terraform Plan — `success`

<details><summary>Show plan output</summary>

```
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOGM2YjQzYy1mYjg2LTQ4MGQtODc5NC04MTQ2N2M3ZDkxNTc7b2JqZWN0SWQ9ZWI0MTNhZGUtMGE3Yy00OGUxLTgxYjMtNWIxNWQ4YTEwZThjO3N1YnNjcmlwdGlvbklkPTc3YmQ1ODkzLTBhNjMtNDQ5YS1iM2NmLWUxYWQ3ZGNhZGFlZTt0ZW5hbnRJZD1hMTYxNWRhNS1jYWY4LTRhNGYtOTUwYS1jYTVmMDk4NzZkZTM=]
azuread_application.elevated_cicd: Refreshing state... [id=/applications/a52403b5-0d17-4df5-a4b4-e9306d4b4d44]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.azurerm_function_app_host_keys.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_function_app_host_keys" "main" {
      + blobs_extension_key             = (sensitive value)
      + default_function_key            = (sensitive value)
      + durabletask_extension_key       = (sensitive value)
      + event_grid_extension_config_key = (sensitive value)
      + event_grid_extension_key        = (sensitive value)
      + id                              = (known after apply)
      + name                            = "func-sample-app-001"
      + primary_key                     = (sensitive value)
      + resource_group_name             = "rg-sample-app-dev"
      + signalr_extension_key           = (sensitive value)
      + webpubsub_extension_key         = (sensitive value)
    }

  # azuread_application.cicd will be created
  + resource "azuread_application" "cicd" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "sample-app-cicd-dev"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "eb413ade-0a7c-48e1-81b3-5b15d8a10e8c",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = [
          + "cicd",
          + "dev",
          + "managed-by-terraform",
          + "sample-app",
        ]
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application.main will be created
  + resource "azuread_application" "main" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "sample-app-api-dev"
      + id                          = (known after apply)
      + identifier_uris             = [
          + "api://sample-app-dev",
        ]
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "eb413ade-0a7c-48e1-81b3-5b15d8a10e8c",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = [
          + "dev",
          + "managed-by-terraform",
          + "sample-app",
        ]
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access the Sample App API on behalf of the signed-in user."
              + admin_consent_display_name = "Access Sample App API"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access the Sample App API on your behalf."
              + user_consent_display_name  = "Access Sample App API"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags (known after apply)

      + single_page_application {
          + redirect_uris = [
              + "http://localhost:3000/",
              + "https://wonderful-grass-0ef9b920f.4.azurestaticapps.net/",
            ]
        }
    }

  # azuread_application_federated_identity_credential.github_env_development will be created
  + resource "azuread_application_federated_identity_credential" "github_env_development" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "github-env-development"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:rkaliupin/DAGent:environment:development"
    }

  # azuread_application_federated_identity_credential.github_main will be created
  + resource "azuread_application_federated_identity_credential" "github_main" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "github-main"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:rkaliupin/DAGent:ref:refs/heads/main"
    }

  # azuread_service_principal.cicd will be created
  + resource "azuread_service_principal" "cicd" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "eb413ade-0a7c-48e1-81b3-5b15d8a10e8c",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = [
          + "cicd",
          + "dev",
          + "managed-by-terraform",
          + "sample-app",
        ]
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal.main will be created
  + resource "azuread_service_principal" "main" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "eb413ade-0a7c-48e1-81b3-5b15d8a10e8c",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = [
          + "dev",
          + "managed-by-terraform",
          + "sample-app",
        ]
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_api_management.main will be created
  + resource "azurerm_api_management" "main" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus2"
      + management_api_url            = (known after apply)
      + name                          = "apim-sample-app-001"
      + notification_sender_email     = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "p7882250@gmail.com"
      + publisher_name                = "Sample App"
      + resource_group_name           = "rg-sample-app-dev"
      + scm_url                       = (known after apply)
      + sku_name                      = "Consumption_0"
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + virtual_network_type          = "None"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up (known after apply)

      + tenant_access (known after apply)

      + timeouts {
          + create = "2h"
          + delete = "1h"
          + update = "1h"
        }
    }

  # azurerm_api_management_api.demo_auth[0] will be created
  + resource "azurerm_api_management_api" "demo_auth" {
      + api_management_name   = "apim-sample-app-001"
      + api_type              = (known after apply)
      + display_name          = "Demo Auth API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "api-demo-auth"
      + path                  = "demo-auth"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "rg-sample-app-dev"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                # =============================================================================
                # Demo Auth API — OpenAPI 3.0.3
                # =============================================================================
                # Only deployed when auth_mode = "demo".
                # Validates shared credentials and returns a demo token for subsequent API calls.
                # =============================================================================
                openapi: "3.0.3"
                info:
                  title: Demo Auth API
                  version: "1.0.0"
                  description: Demo authentication endpoint for shared username/password login.
                paths:
                  /auth/login:
                    post:
                      operationId: demoLogin
                      summary: Authenticate with demo credentials
                      description: Validates username/password and returns a demo token.
                      requestBody:
                        required: true
                        content:
                          application/json:
                            schema:
                              type: object
                              required:
                                - username
                                - password
                              properties:
                                username:
                                  type: string
                                password:
                                  type: string
                      responses:
                        "200":
                          description: Successful authentication
                          content:
                            application/json:
                              schema:
                                type: object
                                properties:
                                  token:
                                    type: string
                                  displayName:
                                    type: string
                        "401":
                          description: Invalid credentials
                          content:
                            application/json:
                              schema:
                                type: object
                                properties:
                                  error:
                                    type: string
                                  message:
                                    type: string
                        "404":
                          description: Demo auth is disabled
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api.sample will be created
  + resource "azurerm_api_management_api" "sample" {
      + api_management_name   = "apim-sample-app-001"
      + api_type              = (known after apply)
      + display_name          = "Sample API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "api-sample"
      + path                  = "sample"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "rg-sample-app-dev"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                # =============================================================================
                # Sample API — OpenAPI 3.0.3
                # =============================================================================
                # Protected endpoint demonstrating dual-mode auth (demo + Entra ID).
                # APIM applies check-header or validate-jwt based on auth_mode.
                # =============================================================================
                openapi: "3.0.3"
                info:
                  title: Sample API
                  version: "1.0.0"
                  description: Sample protected API endpoint.
                paths:
                  /hello:
                    get:
                      operationId: hello
                      summary: Get a greeting
                      description: Returns a greeting message. Protected by APIM auth policy.
                      parameters:
                        - name: name
                          in: query
                          required: false
                          schema:
                            type: string
                            default: World
                      responses:
                        "200":
                          description: Successful response
                          content:
                            application/json:
                              schema:
                                type: object
                                properties:
                                  message:
                                    type: string
                                  timestamp:
                                    type: string
                                    format: date-time
                        "401":
                          description: Unauthorized — missing or invalid auth token
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api_policy.demo_auth[0] will be created
  + resource "azurerm_api_management_api_policy" "demo_auth" {
      + api_management_name = "apim-sample-app-001"
      + api_name            = "api-demo-auth"
      + id                  = (known after apply)
      + resource_group_name = "rg-sample-app-dev"
      + xml_content         = (known after apply)
    }

  # azurerm_api_management_api_policy.sample will be created
  + resource "azurerm_api_management_api_policy" "sample" {
      + api_management_name = "apim-sample-app-001"
      + api_name            = "api-sample"
      + id                  = (known after apply)
      + resource_group_name = "rg-sample-app-dev"
      + xml_content         = (known after apply)
    }

  # azurerm_api_management_backend.func will be created
  + resource "azurerm_api_management_backend" "func" {
      + api_management_name = "apim-sample-app-001"
      + id                  = (known after apply)
      + name                = "sample-app-func-backend"
      + protocol            = "http"
      + resource_group_name = "rg-sample-app-dev"
      + resource_id         = (known after apply)
      + url                 = (known after apply)

      + credentials {
          + header = {
              + "x-functions-key" = "{{func-host-key}}"
            }
        }
    }

  # azurerm_api_management_diagnostic.appinsights will be created
  + resource "azurerm_api_management_diagnostic" "appinsights" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "apim-sample-app-001"
      + http_correlation_protocol = (known after apply)
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + resource_group_name       = "rg-sample-app-dev"
      + sampling_percentage       = 100
      + verbosity                 = "information"

      + backend_request (known after apply)

      + backend_response (known after apply)

      + frontend_request (known after apply)

      + frontend_response (known after apply)
    }

  # azurerm_api_management_logger.appinsights will be created
  + resource "azurerm_api_management_logger" "appinsights" {
      + api_management_name = "apim-sample-app-001"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "apim-logger-appinsights"
      + resource_group_name = "rg-sample-app-dev"
      + resource_id         = (known after apply)

      + application_insights {
          + connection_string = (sensitive value)
        }
    }

  # azurerm_api_management_named_value.demo_token[0] will be created
  + resource "azurerm_api_management_named_value" "demo_token" {
      + api_management_name = "apim-sample-app-001"
      + display_name        = "demo-token"
      + id                  = (known after apply)
      + name                = "demo-token"
      + resource_group_name = "rg-sample-app-dev"
      + secret              = true

      + value_from_key_vault {
          + secret_id = (known after apply)
        }
    }

  # azurerm_api_management_named_value.func_host_key will be created
  + resource "azurerm_api_management_named_value" "func_host_key" {
      + api_management_name = "apim-sample-app-001"
      + display_name        = "func-host-key"
      + id                  = (known after apply)
      + name                = "func-host-key"
      + resource_group_name = "rg-sample-app-dev"
      + secret              = true

      + value_from_key_vault {
          + secret_id = (known after apply)
        }
    }

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "Node.JS"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "eastus2"
      + name                                = "appi-sample-app-001"
      + resource_group_name                 = "rg-sample-app-dev"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + workspace_id                        = (known after apply)
    }

  # azurerm_function_app_flex_consumption.main will be created
  + resource "azurerm_function_app_flex_consumption" "main" {
      + app_settings                                   = (known after apply)
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + instance_memory_in_mb                          = 2048
      + kind                                           = (known after apply)
      + location                                       = "eastus2"
      + maximum_instance_count                         = 100
      + name                                           = "func-sample-app-001"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-sample-app-dev"
      + runtime_name                                   = "node"
      + runtime_version                                = "22"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_access_key                             = (sensitive value)
      + storage_authentication_type                    = "StorageAccountConnectionString"
      + storage_container_endpoint                     = (known after apply)
      + storage_container_type                         = "blobContainer"
      + tags                                           = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus2"
      + name                          = "kv-sampleapp-001"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + rbac_authorization_enabled    = true
      + resource_group_name           = "rg-sample-app-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + tenant_id                     = "a1615da5-caf8-4a4f-950a-ca5f09876de3"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.demo_token[0] will be created
  + resource "azurerm_key_vault_secret" "demo_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "demo-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.func_host_key will be created
  + resource "azurerm_key_vault_secret" "func_host_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "func-host-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = true
      + location                        = "eastus2"
      + name                            = "log-sample-app-001"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-sample-app-dev"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_role_assignment.apim_kv_secrets_user will be created
  + resource "azurerm_role_assignment" "apim_kv_secrets_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.cicd_contributor will be created
  + resource "azurerm_role_assignment" "cicd_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.cicd_kv_secrets_user will be created
  + resource "azurerm_role_assignment" "cicd_kv_secrets_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.func_kv_secrets_user will be created
  + resource "azurerm_role_assignment" "func_kv_secrets_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kv_secrets_officer will be created
  + resource "azurerm_role_assignment" "kv_secrets_officer" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "eb413ade-0a7c-48e1-81b3-5b15d8a10e8c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.main will be created
  + resource "azurerm_service_plan" "main" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "eastus2"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "asp-sample-app-001"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-sample-app-dev"
      + sku_name                        = "FC1"
      + tags                            = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
      + worker_count                    = (known after apply)
    }

  # azurerm_static_web_app.main will be created
  + resource "azurerm_static_web_app" "main" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "eastus2"
      + name                               = "swa-sample-app-001"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-sample-app-dev"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }
    }

  # azurerm_storage_account.func_runtime will be created
  + resource "azurerm_storage_account" "func_runtime" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus2"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stsampleapp001"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-sample-app-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "sample-app"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.func_deployments will be created
  + resource "azurerm_storage_container" "func_deployments" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "app-package"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # random_uuid.demo_token[0] will be created
  + resource "random_uuid" "demo_token" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # random_uuid.oauth2_scope_id will be created
  + resource "random_uuid" "oauth2_scope_id" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + apim_gateway_url                       = (known after apply)
  + application_insights_connection_string = (sensitive value)
  + cicd_client_id                         = (known after apply)
  + entra_client_id                        = (known after apply)
  + function_app_name                      = "func-sample-app-001"
  + function_app_url                       = (known after apply)
  + key_vault_name                         = "kv-sampleapp-001"
  + swa_name                               = "swa-sample-app-001"
  + swa_url                                = (known after apply)

Error: Retrieving Application (Application: "a52403b5-0d17-4df5-a4b4-e9306d4b4d44")

  with azuread_application.elevated_cicd,
  on cicd.tf line 79, in resource "azuread_application" "elevated_cicd":
  79: resource "azuread_application" "elevated_cicd" {

unexpected status 403 (403 Forbidden) with error:
Authorization_RequestDenied: Insufficient privileges to complete the
operation.
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

*Pushed by @RomanKaliupinMelonusa · Workflow: `Deploy Infrastructure`*